Repository: DominikBitzer/LANbeacon
Catalog: src/l10n/*/lanbeacon.po
Languages: de

source: failed. Sent challenge: %ld Received Challenge: %ld Timestamp: %ld.
de: fehlgeschlagen. Gesendete challenge: %ld Empfangene challenge: %ld Zeitstempel: %ld.

source: failed. Signature could not be verified.
de: fehlgeschlagen. Signatur konnte nicht verifiziert werden.

source: successfull.
de: erfolgreich.

source: Authentication:
de: Authentifizierung:

source: Combined String:
de: Gesammelter String:

source: Error Parsing IP-address: %s
de: Fehler beim Parsen der IP-Adresse: %s

source: Exiting since no valid IP networks (format e.g. 192.168.178.1/24) could be found in provided string "%s".
de: Programm wird beendet, da keine gültigen IP-Subnetze in dem übergebenen String "%s" gefunden werden konnten (Korrektes Format z.B. 192.168.178.1/24).

source: Freetext:
de: Freitext:

source: Length of passed password too long. Exiting
de: Übergebenen Passwort zu lang. Programm wird beendet

source: Line %i:
de: Zeile %i:

source: Maximum of 1500 Bytes in LAN-Beacon frame exceeded, not all information will be transmitted. Please include less information.
de: Maximale Länge des LAN-Beacon Rahmens von 1500 Byte überschritten, es werden nicht alle Informationen gesendet. Bitte geben Sie weniger Informationen an.

source: No sufficiently long password was provided for private key! Please enter 4 to 1023 characters
de: Es wurde kein ausreichend langes Passwort für den privaten Schlüssel angegeben. Bitte geben Sie zwischen 4 und 1023 Zeichen an.

source: Passed path to signing key too long. Exiting.
de: Übergebener Pfad zum privaten Schlüssel zu lang. Programm wird beendet.

source: Passed path to verifying key too long. Exiting.
de: Übergebener Pfad zum öffentlichen Schlüssel zu lang. Programm wird beendet.

source: String: %s is too long to be included as text and will be skipped
de: String: %s ist zu lang, um in Textform versendet zu werden und wird daher übersprungen

source: There is an error in the passed email-address.
de: Es gibt einen Fehler in der angegebenen Email-Adresse.

source: Usage:
de: Benutzung:

source: Warning, TLV is %i Bytes long, exceeding maximum of 507 characters in String. End of string will be cut off.
de: Warnung, TLV ist %i Bytes lang und überschreitet das Maximum von 507 Zeichen im String. Ende des Strings wird abgeschnitten.

source: malloc error of "combinedString" in mergedlanbeaconCreator
de: malloc Fehler in "combinedString" in mergedlanbeaconCreator

source: malloc error of "mylanbeacon" in mergedlanbeaconCreator
de: malloc Fehler von "mylanbeacon" in mergedlanbeaconCreator

source: malloc error of "parsedTLVs" in evaluatelanbeacon
de: malloc Fehler von "parsedTLVs" in evaluatelanbeacon

source: problem with signature verification
de: Problem bei der Verifikation der Signatur
